Revit 2027 API
BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionComponentsRelationship Property
 Cannot create custom connection due to relationships to external elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralCustomConnectionComponentsRelationship { get; }
Public Shared ReadOnly Property StructuralCustomConnectionComponentsRelationship As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralCustomConnectionComponentsRelationship {
	FailureDefinitionId^ get ();
}
static member StructuralCustomConnectionComponentsRelationship : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace